var code = [
  { id: "101", msg: "未知错误" },
  { id: "102", msg: "用户不存在" },
  { id: "103", msg: "用户名或密码错误，请重新输入!" },
  { id: "105", msg: "缺失参数" },
  { id: "106", msg: "数据库查询错误" },
  { id: "107", msg: "用户未登录" },
  { id: "108", msg: "调用密钥错误" },
  { id: "109", msg: "调用接口错误" },
  { id: "111", msg: "无数据" },
  { id: "112", msg: "错误json字符串参数" },
  { id: "113", msg: "没有任何更新" },
  { id: "115", msg: "参数为空" },
  { id: "116", msg: "参数错误" },
  { id: "117", msg: "上传文件出错" },
  { id: "129", msg: "旧密码不正确" },
  { id: "404", msg: "找不到服务" },

  { id: "520", msg: "系统出错啦" },
  { id: "521", msg: "请检查参数是否正确，执行数据库操作时出现错误" },
  { id: "601", msg: "名称重复" },
];

let codeObj = {};
code.map(row => {
  codeObj[row.id] = row.msg;
});

export { code, codeObj };
